13/data/attachments/b5d425e0925b3150.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_dcc11106-01e2-4d83-9a16-cdafc658bc1e</nif:username>
            <nif:friendToBeAdded>Heather_oil_Actions_23566_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>